In [8]:
import pandas as pd 
import numpy as np
from pandas import Series, DataFrame

In [ ]:
# obj.values => desak faqat values larni chiqarib beradi 
obj = pd.Series([4,7,-9,6])
obj.values

array([ 4,  7, -9,  6])

In [ ]:
# .index -> qilsak faqat index ni chiqaradi
obj.index

RangeIndex(start=0, stop=4, step=1)

In [ ]:
obj.array

In [ ]:
# index larimiz ketmaketlik bilan oladi
obj2 = pd.Series([5,7,-5,3], index = ['d', 'b', 'a', 'c'])
obj2

d    5
b    7
a   -5
c    3
dtype: int64

In [ ]:
# bu biz aytgan tartib da chiqarib beradi;
obj2[['a','b','c','d']]

a   -5
b    7
c    3
d    5
dtype: int64

In [16]:
# qiymat o'zgartirishimiz mumkin 
obj2['a'] = -10
obj2

d     5
b     7
a   -10
c     3
dtype: int64

In [ ]:
# Shart beriyapmiz 0 dan kattani chiqar
obj2[obj2 > 0]

d    5
b    7
c    3
dtype: int64

In [22]:
# ichidami yani shuni ichida borma
'c' in obj2

True

In [ ]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [ ]:
# Lug'at ko'rinishida qaytaradi
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [ ]:
# Bunda index sates bo'ladi u -> sdata data bo'ladi sates da yo'qlariga NaN qo'yadi
states = ['Californima','Ohio','Oregon','Texas']
obj4 = pd.Series(sdata,index = states)
obj4

Californima        NaN
Ohio           35000.0
Oregon         16000.0
Texas          71000.0
dtype: float64

In [28]:
# Qaysi qismida nan bo'lsa shunga True qo'yib beradi
pd.isna(obj4)

Californima     True
Ohio           False
Oregon         False
Texas          False
dtype: bool

In [ ]:
# Methode ko'rinishi
obj4.isna()

Californima     True
Ohio           False
Oregon         False
Texas          False
dtype: bool

In [31]:
obj4.notna()

Californima    False
Ohio            True
Oregon          True
Texas           True
dtype: bool

In [32]:
obj4.name = 'population'
obj4.index.name = 'state'

obj4

state
Californima        NaN
Ohio           35000.0
Oregon         16000.0
Texas          71000.0
Name: population, dtype: float64

In [ ]:
# indexga qiymat berish
obj.index = ["Bob","Steve","Jeft","Ryan"]
obj

Bob      4
Steve    7
Jeft    -9
Ryan     6
dtype: int64

In [ ]:
# DataFrame malumotni jadval ko'rinishda chiqaradi
data = {"state":["Ohio","Ohio","Ohio","Nevada","Nevada","Nevada"],
        "year":[2000,2001,2002,2001,2002,2003],
        "pop":[1.5,1.7,3.6,2.4,2.9,3.2]}

frame = pd.DataFrame(data)

In [37]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [ ]:
# Boshidan 5 ta ni chiqarib beradi
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [41]:
# Unga parametir bersak ham bo'ladi 
frame.head(2)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7

In [42]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [ ]:
# Endi head() - > ga teskaris bor tail --> u oxiridan chiqarib beradi 
frame.tail(2)

    state  year  pop
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [45]:
frame.tail(3)

    state  year  pop
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [ ]:
frame = pd.DataFrame(data, columns = ['year','state','pop'])
frame

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [ ]:
# debt bu yerda qarzdorlik  
frame = pd.DataFrame(data, columns = ['year','state','pop','debt'])
frame

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [ ]:
# Ustunlarni nomini chiqarib beradi
frame.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [ ]:
# Birinchi index dagi qiymatni olish yani jadvalni qatorini olamiz
frame.loc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [52]:
# debt ga qiymat beriyapmiz
frame['debt'] = 1.6
frame

   year   state  pop  debt
0  2000    Ohio  1.5   1.6
1  2001    Ohio  1.7   1.6
2  2002    Ohio  3.6   1.6
3  2001  Nevada  2.4   1.6
4  2002  Nevada  2.9   1.6
5  2003  Nevada  3.2   1.6

In [53]:
frame.iloc[1]

year     2001
state    Ohio
pop       1.7
debt      1.6
Name: 1, dtype: object

In [54]:
# Endi debt ga ketmaket qiymat qo'yadigan bo'lsak
frame['debt'] = np.arange(6.)
frame

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [55]:
len(frame)

6

In [56]:
val = pd.Series([2, 3, 4, 5, 2, 4])
frame['debt'] = val
frame

   year   state  pop  debt
0  2000    Ohio  1.5     2
1  2001    Ohio  1.7     3
2  2002    Ohio  3.6     4
3  2001  Nevada  2.4     5
4  2002  Nevada  2.9     2
5  2003  Nevada  3.2     4

In [57]:
val = pd.Series([20, 20, 40], index = [1, 3, 5])
frame['debt'] = val
frame

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7  20.0
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4  20.0
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2  40.0

In [ ]:
# Qaysibirida Ohio bo'lsa True,aks yol False qo'yadi
frame['eastern'] = frame['state'] == 'Ohio'
frame

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7  20.0     True
2  2002    Ohio  3.6   NaN     True
3  2001  Nevada  2.4  20.0    False
4  2002  Nevada  2.9   NaN    False
5  2003  Nevada  3.2  40.0    False

In [61]:
# Ustunni o'chirib tashlqmoqchi bo'lsak framedan (del) -> orqali olamiz '
del frame['eastern']
frame

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7  20.0
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4  20.0
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2  40.0

In [63]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
             "Nevada": {2001: 2.4, 2002: 2.9}}
frame3 = pd.DataFrame(populations)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [ ]:
# Teskari qiladi
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [65]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [67]:
#  frame3 da bor qiymatlarni oladi yani 2001 va 2002 frame3 da bor  2003 ga => NaN , NaN oladi
pd.DataFrame(populations, index = [2000,2001, 2002, 2003])

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [68]:
pdata = {'Ohio':frame3['Ohio'][:-1], 'Nevada':frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [69]:
frame3.index.name = 'Year'
frame3.columns.name = 'State'
frame3

State  Ohio  Nevada
Year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [70]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])